Can't cut in half. Move plane towards either end.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CutExactlyHalf { get; }
  Visual Basic
Public Shared ReadOnly Property CutExactlyHalf As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CutExactlyHalf {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CutFailures Class
  Autodesk.Revit.DB Namespace